readme.org
#+STARTUP: show2levels
* torgeir/.doom.d
:PROPERTIES:
:header-args:emacs-lisp: :lexical t :results silent
:END:

Managing [[https://github.com/torgeir/.emacs.d/tree/d1c9dec646824ab7396b8a35fd7da1416a0580d3][a plain emacs config]] that got closer and closer to what you get ootb with [[https://github.com/doomemacs/doomemacs][doom emacs]] was beginning to feel tedious, so this is an attempt to for a setup with ~feature parity on top of doom emacs. It was probably due a clean up after all these years.

** Install

First, install doom emacs.

#+begin_src sh :tangle no :results no
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.emacs.d
~/.emacs.d/bin/doom install
#+end_src

Then the config.

#+begin_src sh :tangle no :results no
cd && git clone git@github.com:torgeir/.emacs.d.git ~/.doom.d
#+end_src

And some terminal shortcuts

#+begin_src sh :tangle no :results no
ln -sf ~/.doom.d/emacsclient ~/bin/e
ln -sf ~/.doom.d/emacsclient-terminal ~/bin/em
#+end_src

There were native comp issues on emacs-plus@28 after upgrading to ventura on mac. Solved by [[https://github.com/d12frosted/homebrew-emacs-plus/issues/485#issuecomment-1308164501][linking libgccjit in the brew lib folder]].

** Doom help

The built in emacs help is fantastic. The doom one on ~SPC h d~ is even better! Here's a few examples.

- [[file:~/.emacs.d/docs/examples.org][Browse examples of useful apis]]
- [[elisp:(call-interactively 'doom/help-modules)][Lookup help for doom modules]]
- [[elisp:(call-interactively 'doom/help-search)][Search for in the doom .emacs.d folder]]
- ~SPC h d h~ to access documentation
- ~SPC h d~ followed by ~C-h~ invokes a fuzzy search of keys available in the formerly pressed binding. This also works with ~SPC~ followed by ~C-h~.
- ~K~ on a module to view its documentation
- ~gd~ on a module to browse its directory

** Literate config

This config uses the =:config literal= that tangles this file to ~config.el~ on save. The [[file:init.el::setq +literate-config-file (concat (getenv "HOME") "/.doom.d/readme.org")][+literate-config-file]] is set in ~init.el~ and points to this file.

*** Configuration inspiration

- https://github.com/zzamboni/dot-doom/blob/master/doom.org
- https://abdelhakbougouffa.pro/posts/config/
 
*** Navigation

I usually navigate this with =c-c c-n= or =c-c c-p=, or =mgg=.

** Packages

This is tangled to ~packages.el~ on save.

#+begin_src emacs-lisp :tangle packages.el
(package! evil-cleverparens)
(package! transpose-frame)
(package! highlight-symbol)
(package! olivetti)
(package! focus)
(package! calendar-norway)
(package! spray)
(package! dired-sidebar)
(package! dired-subtree)
(package! org-ai :recipe (:host github :repo "rksm/org-ai"))
(package! mastodon)
(package! hnreader)
(package! reddigg)
(package! docker-tramp)
(package! blamer
  :recipe (:host github :repo "artawower/blamer.el")
  :pin "99b43779341af0d924bfe2a9103993a6b9e3d3b2")
(package! org-appear
  :recipe (:host github :repo "awth13/org-appear")
  :pin "60ba267c5da336e75e603f8c7ab3f44e6f4e4dac")
(package! remark-mode)
;; (package! tempel)
(package! command-log-mode)
;; fix broken doom install for thesaurus on a mac?
(package! wordnut :pin "feac531404041855312c1a046bde7ea18c674915")
;; fix broken doom install for thesaurus on a mac?
(package! synosaurus :pin "14d34fc92a77c3a916b4d58400424c44ae99cd81")
(package! recursion-indicator)
#+end_src

** Lexical scoping everywhere

The madness that is dynamic is too much for anyone, really.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Recentf

Ignore some of the cached emacs files in recent files

#+begin_src emacs-lisp
(after! recentf
  (add-to-list 'recentf-exclude "\.emacs\.d/\.local"))
#+end_src

** Whoami

#+begin_src emacs-lisp
(let ((email   (getenv "USER_EMAIL"))
      (email-2 (getenv "USER_EMAIL_2")))
  (when (not email)   (error "No USER_EMAIL set?"))
  (when (not email-2) (error "No USER_EMAIL_2 set?"))
  (setq user-full-name "Torgeir Thoresen"
        user-mail-address   email
        user-mail-address-2 email-2))
#+end_src

** 1password

#+begin_src emacs-lisp
(defun t/1p (item &optional args)
  "Lookup 1p item. On linux, sign in manually first."
  (let ((args (or args "--fields label=password")))
    (if is-mac
        (with-temp-buffer
          (if (zerop (call-process-shell-command (format "op item get %s %s" item args) nil t))
              (replace-regexp-in-string (rx "\n" eos) "" (buffer-string))
            (error "1p: looking up item failed.")))
      (let* ((pass (read-passwd "1p master password: "))
             (session-token nil)
             (ret nil))
        (setq session-token (with-temp-buffer
                              (if (zerop (call-process-shell-command (format "echo -n %s | op signin --raw" pass) nil t))
                                  (replace-regexp-in-string (rx "\n" eos) "" (buffer-string))
                                (error "1p: auth failed."))))
        (with-temp-buffer
          (if is-linux
              (call-process-shell-command (format "op --session %s item get %s %s" session-token item args) nil t))
          (replace-regexp-in-string (rx "\n" eos) "" (buffer-string)))))))
#+end_src

** gpg

#+begin_src emacs-lisp
(defun t/gpg ()
  (interactive)
  (shell-command
   (format
    "gpg-connect-agent updatestartuptty /bye > /dev/null && \
       $(gpgconf --list-dirs libexecdir)/gpg-preset-passphrase -c -P '%s' \
       $(gpg --fingerprint --with-keygrip torgeir@keybase.io | awk '/Keygrip/ {print $3}' | tail -n 1) && \
       gpg -q --batch -d ~/.authinfo.gpg > /dev/null"
    (t/1p "keybase.io" "--format json | jq -j '.fields[] | select(.id == \"password\") | .value'"))))
#+end_src

** Org file location setup

#+begin_quote
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
#+end_quote

#+begin_src emacs-lisp
(setq org-directory (expand-file-name "~/Dropbox/org/")
      org-agenda-files '("~/Dropbox/org" "~/Dropbox/org/IFTTT/twitter.txt" "~/Dropbox/org/IFTTT/pocket.txt" )
      org-archive-location "%s_archive.gpg::") ; so files are encrypted automatically
#+end_src

** t-defuns

My old collection of more or less useful defuns.

#+begin_src emacs-lisp
(progn
  (defconst is-win IS-WINDOWS)
  (defconst is-cygwin IS-WINDOWS)
  (defconst is-mac IS-MAC)
  (defconst is-linux IS-LINUX)
  (defun t/user-file (path) (concat (expand-file-name "~/") path))
  (defun t/user-emacs-file (path) (concat (expand-file-name "~/.doom.d/") path))
  (defun t/user-dropbox-folder (path) (expand-file-name (concat "~/Dropbox" (if is-mac " (Personal)" "") "/" path)))
  (load! "./t-defuns.el"))
#+end_src

** Micro state

A small overlay map that exposes a set of key bindings until you press q, or something else not in the keymap.

#+begin_src emacs-lisp
(defun t/micro-state (quit key fn &rest bindings)
  "Micro state that temporarily overlays a new key map, kinda like hydra"
  (let ((keymap (make-sparse-keymap)))
    (while key
      (bind-key key fn keymap)
      (setq key (pop bindings)
            fn (pop bindings)))
    (lambda ()
      (interactive)
      (let ((exit (set-temporary-overlay-map keymap t (lambda () (when quit (quit-window))))))
        (when quit
          (bind-key "q" (cmd! (funcall exit)) keymap))))))
#+end_src

And one that enters a ~mode~, then turns on the keymap. It turns ~mode~ off again if you hit a key not in the map.

#+begin_src emacs-lisp
(defun t/micro-state-in-mode (mode after key fn &rest bindings)
  "Micro state that toggles mode and temporarily overlays a new key map, kinda like hydra"
  (let ((keymap (make-sparse-keymap)))
    (while key
      (bind-key key fn keymap)
      (setq key (pop bindings)
            fn (pop bindings)))
    (lambda ()
      (interactive)
      (funcall mode)
      (set-temporary-overlay-map keymap t (lambda nil
                                            (funcall mode -1)
                                            (when after (after)))))))
#+end_src

** Editor

*** Flash on long jumps

Use =nav-flash= to flash the cursor after long jumps.

#+begin_src emacs-lisp
(after! nav-flash
  (custom-set-faces!
    '(nav-flash-face :background "maroon4")
    '(nav-flash-face :background "#003366"))
  (setq nav-flash-delay 4
        nav-flash-use-pulse 'gui-only))
#+end_src

*** Recursive minibuffers

When you change your mind and need to do something first, after you already started a command that opens the minibuffer.

#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)
#+end_src

And a slightly fancier indicator than ~(minibuffer-depth-indicate-mode)~

#+begin_src emacs-lisp
(use-package! recursion-indicator
  :config
  (recursion-indicator-mode))
#+end_src

*** Initialization

#+begin_src emacs-lisp
(defun +daemon-startup ()
  ;; mu4e
  (when (require 'mu4e nil t)
    ;; Automatically start `mu4e' in background.
    (when (load! "mu-lock.el" (expand-file-name "email/mu4e/autoload" doom-modules-dir) t)
      (setq +mu4e-lock-greedy t
            +mu4e-lock-relaxed t)
      (when (+mu4e-lock-available t)
        ;; Each 5m, if `mu4e' if closed, start it in background.
        (run-at-time nil ;; Launch now
                     (* 5 60)
                     (lambda ()
                       (when (and (not (mu4e-running-p)) (+mu4e-lock-available))
                         (mu4e--start)
                         (message "Started `mu4e' in background.")))))))

  ;; rss
  (when (require 'elfeed nil t)
    (run-at-time nil (* 2 60 60) #'elfeed-update)))

(when (daemonp)
  (add-hook 'emacs-startup-hook #'+daemon-startup)
  (add-hook 'server-after-make-frame-hook #'doom/reload-theme))
#+end_src

In daemon mode history is not saved and recent files is not updated, so help

#+begin_src emacs-lisp
(when (daemonp)
  (add-hook! '(delete-frame-functions delete-terminal-functions)
    (defun t/help-save-history-in-daemon ()
      (let ((inhibit-message t))
        (recentf-save-list)
        (savehist-save)))))
#+end_src

*** Auth sources

Move ~~/.authinfo.gpg~ to the front. It is originally behind the macos keychain that doom puts in there.

#+begin_src emacs-lisp
(after! auth-source (setq auth-sources (nreverse auth-sources)))
#+end_src

When starting Emacs in daemon mode, ask for a valid passphrase in the gpg-agent.

#+begin_src emacs-lisp
(when (daemonp)
  (let ((try-again 3)
        unlocked)
    (while (not (or unlocked
                    (zerop try-again)))
      (setq unlocked (zerop (shell-command "gpg -q --no-tty --logger-file /dev/null --batch -d ~/.authinfo.gpg > /dev/null" nil nil))
            try-again (1- try-again))
      (unless unlocked (message "GPG: failed to unlock, please try again (%d)" try-again)))
    (unless unlocked (kill-emacs 1))))
#+end_src

Defaults

#+begin_src emacs-lisp
(let ((h (* 4 60 60)))
  (setq auth-source-do-cache t
        auth-source-cache-expiry h
        password-cache t
        password-cache-expiry h))

(after! epa
  (setq-default epa-file-encrypt-to '("torgeir@keybase.io")))
#+end_src


Wait just long enough.

#+begin_src emacs-lisp
(setq which-key-idle-delay 0.5
      which-key-idle-secondary-delay 0.05)
#+end_src

*** Disable annoying defaults

Reset [[file:~/.emacs.d/modules/config/default/config.el::(map! "<M-up>" #'drag-stuff-up][drag stuff on meta arrows]], ~m-left/right~ is too engrained to move between words.

#+begin_src emacs-lisp
;; (add-to-list 'drag-stuff-except-modes 'org-src-mode)
(add-hook! 'doom-after-init-modules-hook
  (defun t/unbind-drag-stuff ()
    (map! "<M-left>"  nil
          "<M-right>" nil)))
#+end_src

Remove highlight indent guides by default

#+begin_src emacs-lisp
(remove-hook! '(prog-mode-hook text-mode-hook conf-mode-hook) 'highlight-indent-guides-mode)
#+end_src

Soft wrap everywhere

#+begin_src emacs-lisp
(add-hook! 'doom-after-init-hook
  (defun t/after-init-hook ()
    (global-emojify-mode -1)
    (global-visual-line-mode 1)))
#+end_src

Truncate lines everywhere

#+begin_src emacs-lisp
(add-hook! '(prog-mode-hook text-mode-hook conf-mode-hook)
  (defun t/prog-mode-hook ()
    (interactive)
    (toggle-truncate-lines 0)
    (toggle-truncate-lines 1)))
#+end_src

*** Whitespace

#+begin_src emacs-lisp
;;(add-to-list 'whitespace-style 'trailing)
(add-hook!
 'prog-mode-hook
 (defun t/set-whitespace-style ()
   (interactive)
   (setq whitespace-style '(face tabs trailing lines ;; space-mark spaces
                             space-before-tab newline indentation
                             empty space-after-tab tab-mark
                             newline-mark missing-newline-at-eof))))
#+end_src

*** Evil

I spent so much time with vim, I will probably never give it up.

**** Config

Useful for ~c-e~ followed by ~c-x c-e~ to eval a s-exp. Makes ~cleverparens~ nav commands like ~L~ and ~H~ move across sexps

#+begin_src emacs-lisp
(setq evil-move-beyond-eol t)
#+end_src

Don't use zz and zq for org src editing

#+begin_src emacs-lisp
(after! evil-collection
  (add-to-list 'evil-collection-key-blacklist "ZZ")
  (add-to-list 'evil-collection-key-blacklist "ZQ"))
#+end_src

Fine undo

#+begin_src emacs-lisp
(after! evil
  (setq evil-want-fine-undo t))
#+end_src

**** Unbind C-h in evil window bindings

I use ~SPC w h~ instead of ~SPC w C-h~ to move to the left window. ~C-h~ is more useful as =embark-prefix-help-command=, which this falls back to, like in all other keymaps

#+begin_src emacs-lisp
(map! :after evil :map evil-window-map "C-h" nil)
#+end_src

Try e.g. ~SPC C-h~ to browse all available commands with vertico.

**** Increment & Decrement number

#+begin_src emacs-lisp
(map! :n "g-" #'evil-numbers/dec-at-pt
      :n "g+" #'evil-numbers/inc-at-pt)
#+end_src

**** Registers

Some macros I once used.

This one makes camelCaseWords into to snake_case_words. Run it with ~@c~

#+begin_src emacs-lisp
(evil-set-register ?c [?: ?s ?/ ?\\ ?\( ?\[ ?a ?- ?z ?0 ?- ?9 ?\] ?\\ ?\) ?\\ ?\( ?\[ ?A ?- ?Z ?0 ?- ?9 ?\] ?\\ ?\) ?/ ?\\ ?1 ?_ ?\\ ?l ?\\ ?2 ?/ ?g])
#+end_src

*** Macros

A useful macro one for testing stuff out

#+begin_src emacs-lisp
(defmacro comment (&rest ignore)
  nil)

(comment
 (funcall (t/micro-state nil "m" (cmd! (message "1")))))
#+end_src

